app/Controllers/Owner/DashboardController.php

SELECT *
FROM `dashboards`
WHERE `id` = '2'
AND `application_id` = '1'
AND `dashboards`.`deleted_at` IS NULL
 LIMIT 1
SELECT *
FROM `dashboard_widgets`
WHERE `dashboard_id` = '2'
AND `is_visible` = 1
ORDER BY `sort_order` ASC
SELECT *
FROM `statistic_configs`
WHERE `statistic_configs`.`deleted_at` IS NULL
AND `statistic_configs`.`id` = '6'
---
    public function preview($id)
    {
        $applicationId = session()->get('application_id');

        // Validate dashboard ownership
        $dashboard = $this->dashboardModel
            ->where('id', $id)
            ->where('application_id', $applicationId)
            ->first();

        if (!$dashboard) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound('Dashboard tidak ditemukan');
        }

        // Get dashboard widgets
        $widgetModel = new \App\Models\Owner\DashboardWidgetModel();
        $widgets = $widgetModel->where('dashboard_id', $id)
                              ->where('is_visible', 1)
                              ->orderBy('sort_order', 'ASC')
                              ->findAll();

        // Get statistics data for each widget
        $statisticModel = new \App\Models\Owner\StatisticConfigModel();
        $widgetData = [];

        foreach ($widgets as $widget) {
            if (!empty($widget['statistic_config_id'])) {
                $statistic = $statisticModel->find($widget['statistic_config_id']);