app/Controllers/Owner/DatasetController.php

SELECT `datasets`.*, `users`.`nama_lengkap` as `uploader_name`
FROM `datasets`
JOIN `users` ON `users`.`id` = `datasets`.`uploaded_by`
WHERE `datasets`.`application_id` = '1'
AND `datasets`.`deleted_at` IS NULL
AND `datasets`.`deleted_at` IS NULL
ORDER BY `datasets`.`created_at` DESC
---
    public function index()
    {
        // Cek login dan role
        if (!session()->get('logged_in') || session()->get('role_name') !== 'owner') {
            return redirect()->to('/login')->with('error', 'Anda harus login sebagai owner');
        }

        $applicationId = session()->get('application_id');

        if (!$applicationId) {
            return redirect()->to('/owner/application/create')
                ->with('info', 'Silakan buat aplikasi terlebih dahulu');
        }

        // Get all datasets
        $datasets = $this->datasetModel
            ->select('datasets.*, users.nama_lengkap as uploader_name')
            ->join('users', 'users.id = datasets.uploaded_by')
            ->where('datasets.application_id', $applicationId)
            ->where('datasets.deleted_at', null)
            ->orderBy('datasets.created_at', 'DESC')
            ->findAll();

SELECT *
FROM `datasets`
WHERE `application_id` = '1'
AND `dataset_slug` = 'tw-3-tanah-bumbu'
AND `datasets`.`deleted_at` IS NULL
 LIMIT 1
---
            $slug = url_title($datasetName, '-', true);

            // Ensure unique slug
            $existingSlug = $this->datasetModel
                ->where('application_id', $applicationId)
                ->where('dataset_slug', $slug)
                ->first();

INSERT INTO `datasets` (`application_id`, `dataset_name`, `dataset_slug`, `description`, `file_path`, `file_name`, `file_size`, `upload_status`, `uploaded_by`, `created_at`) VALUES ('1', 'TW 3 Tanah Bumbu', 'tw-3-tanah-bumbu-695dea510b3a9', '', 'uploads/datasets/1/1767762513_64536dc63d2c8b6685e8.xlsx', '1767762513_64536dc63d2c8b6685e8.xlsx', 108519, 'processing', '3', '2026-01-07 13:08:33')
---
                'created_at' => date('Y-m-d H:i:s')
            ];

            $datasetId = $this->datasetModel->insert($datasetData);

SELECT *
FROM `datasets`
WHERE `id` = '18'
AND `application_id` = '1'
AND `deleted_at` IS NULL
AND `datasets`.`deleted_at` IS NULL
 LIMIT 1
---
    public function view($id)
    {
        // Cek login dan role
        if (!session()->get('logged_in') || session()->get('role_name') !== 'owner') {
            return redirect()->to('/login')->with('error', 'Anda harus login sebagai owner');
        }

        $applicationId = session()->get('application_id');

        // Get dataset
        $dataset = $this->datasetModel
            ->where('id', $id)
            ->where('application_id', $applicationId)
            ->where('deleted_at', null)
            ->first();

SELECT *
FROM `datasets`
WHERE `id` = '18'
AND `application_id` = '1'
AND `deleted_at` IS NULL
AND `datasets`.`deleted_at` IS NULL
 LIMIT 1
---
    public function preview($id)
    {
        // Cek login dan role
        if (!session()->get('logged_in') || session()->get('role_name') !== 'owner') {
            return redirect()->to('/login')->with('error', 'Anda harus login sebagai owner');
        }

        $applicationId = session()->get('application_id');

        // Get dataset
        $dataset = $this->datasetModel
            ->where('id', $id)
            ->where('application_id', $applicationId)
            ->where('deleted_at', null)
            ->first();

SELECT *
FROM `datasets`
WHERE `id` = '18'
AND `application_id` = '1'
AND `deleted_at` IS NULL
AND `datasets`.`deleted_at` IS NULL
 LIMIT 1
---
    public function delete($id)
    {
        // Check if this is an AJAX request
        $isAjax = $this->request->isAJAX();

        // Cek login dan role
        if (!session()->get('logged_in') || session()->get('role_name') !== 'owner') {
            if ($isAjax) {
                return $this->response->setJSON([
                    'success' => false,
                    'message' => 'Unauthorized'
                ]);
            }
            return redirect()->to('/login')->with('error', 'Anda harus login sebagai owner');
        }

        $applicationId = session()->get('application_id');

        // Get dataset
        $dataset = $this->datasetModel
            ->where('id', $id)
            ->where('application_id', $applicationId)
            ->where('deleted_at', null)
            ->first();

UPDATE `datasets` SET `deleted_at` = '2026-01-07 13:09:08'
WHERE `datasets`.`id` IN ('18')
---

        try {
            // Soft delete
            $deleted = $this->datasetModel->update($id, [
                'deleted_at' => date('Y-m-d H:i:s')
            ]);

SELECT *
FROM `datasets`
WHERE `id` = '18'
AND `application_id` = '1'
AND `deleted_at` IS NULL
AND `datasets`.`deleted_at` IS NULL
 LIMIT 1
---
    public function records($id)
    {
        // Cek login dan role
        if (!session()->get('logged_in') || session()->get('role_name') !== 'owner') {
            return redirect()->to('/login')->with('error', 'Anda harus login sebagai owner');
        }

        $applicationId = session()->get('application_id');

        // Get dataset
        $dataset = $this->datasetModel
            ->where('id', $id)
            ->where('application_id', $applicationId)
            ->where('deleted_at', null)
            ->first();

SELECT *
FROM `datasets`
WHERE `id` = '18'
AND `application_id` = '1'
AND `deleted_at` IS NULL
AND `datasets`.`deleted_at` IS NULL
 LIMIT 1
---
    public function edit($id)
    {
        // Cek login dan role
        if (!session()->get('logged_in') || session()->get('role_name') !== 'owner') {
            return redirect()->to('/login')->with('error', 'Anda harus login sebagai owner');
        }

        $applicationId = session()->get('application_id');

        // Get dataset
        $dataset = $this->datasetModel
            ->where('id', $id)
            ->where('application_id', $applicationId)
            ->where('deleted_at', null)
            ->first();

INSERT INTO `log_activities` (`user_id`, `application_id`, `activity_type`, `module`, `description`, `ip_address`, `user_agent`, `request_data`) VALUES ('3', '1', 'upload', 'datasets', 'Owner upload dataset: TW 3 Tanah Bumbu', '::1', 'Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/143.0.0.0 Safari/537.36', '{\"dataset_id\":18,\"file_name\":\"1767762513_64536dc63d2c8b6685e8.xlsx\"}')
---
    private function logActivity($activityType, $module, $description, $data = [])
    {
        $logData = [
            'user_id' => session()->get('user_id'),
            'application_id' => session()->get('application_id'),
            'activity_type' => $activityType,
            'module' => $module,
            'description' => $description,
            'ip_address' => $this->request->getIPAddress(),
            'user_agent' => $this->request->getUserAgent()->getAgentString(),
            'request_data' => json_encode($data)
        ];

        $db = \Config\Database::connect();
        $db->table('log_activities')->insert($logData);