app/Controllers/Owner/StatisticController.php

SELECT `statistic_configs`.*, `datasets`.`dataset_name`, `users`.`nama_lengkap` as `creator_name`
FROM `statistic_configs`
JOIN `datasets` ON `datasets`.`id` = `statistic_configs`.`dataset_id`
JOIN `users` ON `users`.`id` = `statistic_configs`.`created_by`
WHERE `statistic_configs`.`application_id` = '1'
AND `statistic_configs`.`deleted_at` IS NULL
AND `statistic_configs`.`deleted_at` IS NULL
ORDER BY `statistic_configs`.`created_at` DESC
---
    public function index()
    {
        // Cek login dan role
        if (!session()->get('logged_in') || session()->get('role_name') !== 'owner') {
            return redirect()->to('/login')->with('error', 'Anda harus login sebagai owner');
        }

        $applicationId = session()->get('application_id');

        if (!$applicationId) {
            return redirect()->to('/owner/application/create');
        }

        // Get all statistics
        $statistics = $this->statisticModel
            ->select('statistic_configs.*, datasets.dataset_name, users.nama_lengkap as creator_name')
            ->join('datasets', 'datasets.id = statistic_configs.dataset_id')
            ->join('users', 'users.id = statistic_configs.created_by')
            ->where('statistic_configs.application_id', $applicationId)
            ->where('statistic_configs.deleted_at', null)
            ->orderBy('statistic_configs.created_at', 'DESC')
            ->findAll();

UPDATE `statistic_configs` SET `deleted_at` = '2026-01-07 09:51:47'
WHERE `id` = '8'
AND `application_id` = '1'
---
        try {
            // Use direct database update for soft delete to avoid model issues
            $db = \Config\Database::connect();
            $deleted = $db->table('statistic_configs')
                ->where('id', $id)
                ->where('application_id', $applicationId)
                ->update(['deleted_at' => date('Y-m-d H:i:s')]);

INSERT INTO `log_activities` (`user_id`, `application_id`, `activity_type`, `module`, `description`, `ip_address`, `user_agent`, `request_data`) VALUES ('3', '1', 'delete', 'statistics', 'Owner menghapus statistik: test', '::1', 'Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/143.0.0.0 Safari/537.36', '{\"statistic_id\":\"8\"}')
---
    private function logActivity($activityType, $module, $description, $data = [])
    {
        $logData = [
            'user_id' => session()->get('user_id'),
            'application_id' => session()->get('application_id'),
            'activity_type' => $activityType,
            'module' => $module,
            'description' => $description,
            'ip_address' => $this->request->getIPAddress(),
            'user_agent' => $this->request->getUserAgent()->getAgentString(),
            'request_data' => json_encode($data)
        ];

        $db = \Config\Database::connect();
        $db->table('log_activities')->insert($logData);