app/Controllers/Owner/UserManageController.php

    public function index()
    {
        if (!session()->get('logged_in') || session()->get('role_name') !== 'owner') {
            return redirect()->to('/login');
        }

        $applicationId = session()->get('application_id');

        $users = $this->userRoleModel
            ->select('users.id, users.nama_lengkap, users.email, users.bidang, users.is_active,
                     roles.role_name, roles.role_label, user_roles.created_at as joined_at')
            ->join('users', 'users.id = user_roles.user_id')
            ->join('roles', 'roles.id = user_roles.role_id')
            ->where('user_roles.application_id', $applicationId)
            ->where('users.deleted_at', null)
            ->findAll();
---
SELECT `users`.`id`, `users`.`nama_lengkap`, `users`.`email`, `users`.`bidang`, `users`.`is_active`, `roles`.`role_name`, `roles`.`role_label`, `user_roles`.`created_at` as `joined_at`
FROM `user_roles`
JOIN `users` ON `users`.`id` = `user_roles`.`user_id`
JOIN `roles` ON `roles`.`id` = `user_roles`.`role_id`
WHERE `user_roles`.`application_id` = '1'
AND `users`.`deleted_at` IS NULL