app/Models/Owner/DatasetRecordModel.php

    public function getByDataset($datasetId, $limit = null, $offset = null)
    {
        $builder = $this->where('dataset_id', $datasetId)
                        ->orderBy('row_num', 'ASC');

        if ($limit) {
            $builder->limit($limit, $offset ?? 0);
        }

        return $builder->findAll();
---
SELECT *
FROM `dataset_records`
WHERE `dataset_id` = '16'
ORDER BY `row_num` ASC
 LIMIT 1000