app/Models/Owner/StatisticConfigModel.php

    public function calculateStatistic($statisticId)
    {
        try {
            // Get statistic configuration
            $statistic = $this->find($statisticId);
---
SELECT *
FROM `statistic_configs`
WHERE `statistic_configs`.`deleted_at` IS NULL
AND `statistic_configs`.`id` = '6'