app/Models/Superadmin/UserRoleModel.php

    public function hasRole($userId, $roleName, $applicationId = null)
    {
        $builder = $this->select('user_roles.*')
                        ->join('roles', 'roles.id = user_roles.role_id')
                        ->where('user_roles.user_id', $userId)
                        ->where('roles.role_name', $roleName);

        if ($applicationId !== null) {
            $builder->where('user_roles.application_id', $applicationId);
        }

        return $builder->countAllResults() > 0;
---
SELECT COUNT(*) AS `numrows`
FROM `user_roles`
JOIN `roles` ON `roles`.`id` = `user_roles`.`role_id`
WHERE `user_roles`.`user_id` = '3'
AND `roles`.`role_name` = 'owner'
AND `user_roles`.`application_id` = '1'

    public function isSuperadmin($userId)
    {
        return $this->select('user_roles.*')
                    ->join('roles', 'roles.id = user_roles.role_id')
                    ->where('user_roles.user_id', $userId)
                    ->where('roles.role_name', 'superadmin')
                    ->where('user_roles.application_id', null)
                    ->countAllResults() > 0;
---
SELECT COUNT(*) AS `numrows`
FROM `user_roles`
JOIN `roles` ON `roles`.`id` = `user_roles`.`role_id`
WHERE `user_roles`.`user_id` = '3'
AND `roles`.`role_name` = 'superadmin'
AND `user_roles`.`application_id` IS NULL