app/Libraries/ComputationEngine.php

SELECT *
FROM `datasets`
WHERE `datasets`.`deleted_at` IS NULL
AND `datasets`.`id` = '16'
---
    public function calculate($datasetIdOrConfig, $config = null)
    {
        // Detect signature
        if ($config === null && is_array($datasetIdOrConfig)) {
            // Signature 2: calculate($config)
            $config = $datasetIdOrConfig;
            $datasetId = $config['dataset_id'] ?? null;

            if (!$datasetId) {
                throw new \Exception("dataset_id diperlukan untuk menghitung statistik. Pastikan statistik sudah dikonfigurasi dengan dataset yang valid.");
            }
        } else {
            // Signature 1: calculate($datasetId, $config)
            $datasetId = $datasetIdOrConfig;
        }

        // Validate metric_type
        $metricType = $config['metric_type'] ?? null;
        if (empty($metricType)) {
            throw new \Exception("metric_type diperlukan untuk menghitung statistik. Pastikan statistik sudah dikonfigurasi dengan metric yang valid (count, sum, average, dll).");
        }

        // Valid metric types
        $validMetricTypes = ['count', 'sum', 'average', 'avg', 'min', 'max', 'percentage', 'ratio', 'growth', 'ranking', 'custom_formula'];
        if (!in_array($metricType, $validMetricTypes)) {
            throw new \Exception("Metric type '{$metricType}' tidak valid. Supported: " . implode(', ', $validMetricTypes));
        }

        // Load dataset schema
        $datasetModel = new \App\Models\Owner\DatasetModel();
        $this->dataset = $datasetModel->find($datasetId);